bill_splitter/app/views/expenses/index.html.erb

          <div class="card-body">
            <% if @user.expenses.any? %>
---
SELECT "expenses".* FROM "expenses"

            <p class="text-muted fst-italic">Click a group to add an expense</p>
            <% if @user.groups.any? %>
              <ul class="list-group list-group-flush">
                <% @user.groups.each do |group| %>
---
SELECT "groups".* FROM "groups" INNER JOIN "group_memberships" ON "groups"."id" = "group_memberships"."group_id" WHERE "group_memberships"."user_id" = 1
SELECT 1 AS one FROM "groups" INNER JOIN "group_memberships" ON "groups"."id" = "group_memberships"."group_id" WHERE "group_memberships"."user_id" = 1 LIMIT 1