bill_splitter/app/views/expenses/index.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 LIMIT 1
---
        <td>
            <% if expense.group %>
                <%= link_to expense.group.group_name, group_path(expense.group), class: "btn btn-link" %>