bill_splitter/app/views/expenses/show.html.erb

    <div class="card-body">
      <% if @expense.expense_splits.any? %>
        <ul class="list-group list-group-flush">
          <% @expense.expense_splits.each do |split| %>
---
SELECT 1 AS one FROM "expense_splits" WHERE "expense_splits"."expense_id" = 1 LIMIT 1
SELECT "expense_splits".* FROM "expense_splits" WHERE "expense_splits"."expense_id" = 1