bill_splitter/app/views/expenses/show.html.erb

    <strong>Group:</strong>
    <% if @expense.group %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 LIMIT 1

</p>
<% if @expense.expense_splits.any? %>
---
SELECT "expense_splits".* FROM "expense_splits" WHERE "expense_splits"."expense_id" = 1
SELECT 1 AS one FROM "expense_splits" WHERE "expense_splits"."expense_id" = 12 LIMIT 1

    Owed to <%= @expense.added_by_user.name if @expense.added_by_user %>
    <% group_users = @expense.group.members %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 12 LIMIT 1