bill_splitter/app/controllers/expenses_controller.rb

  def index
    @expenses = Expense.all
    @user = User.first
---
SELECT "expenses".* FROM "expenses"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1

  def create
    @expense = Expense.new(expense_params)
    if @expense.save
---
INSERT INTO "expenses" ("group_id", "added_by", "description", "total_amount", "created_at", "updated_at") VALUES (1, '9f3dfa55-eb21-4d11-8e0a-b140e6dd6038', 'Movie tickets', 67.0, '2025-04-30 18:36:48.637658', '2025-04-30 18:36:48.637658') RETURNING "id"

  def show
    @expense = Expense.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = 29 LIMIT 1

  def set_users_and_groups
    @users = User.all # Fetch all users from the database
    @groups = Group.all # Fetch all groups from the database
---
SELECT "users".* FROM "users"
SELECT "groups".* FROM "groups"