bill_splitter/app/controllers/api/v1/expenses_controller.rb

    def index
        if params[:group_id]
            expenses = Expense.where(group_id: params[:group_id])
        else
            expenses = Expense.all
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."group_id" = 1
SELECT "expenses".* FROM "expenses"

    def create
        expense = Expense.new(expense_params)
        expense.added_by_user = User.find(params[:expense][:added_by]) if params[:expense][:added_by]

        if expense.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = '4e2e0338-bd9e-4812-a294-145412fdc7e9' LIMIT 1
INSERT INTO "expenses" ("group_id", "added_by", "description", "total_amount", "created_at", "updated_at") VALUES (1, '4e2e0338-bd9e-4812-a294-145412fdc7e9', 'Fancy Dinner', 120.15, '2025-04-28 22:50:30.553235', '2025-04-28 22:50:30.553235') RETURNING "id"

    def destroy
        expense = Expense.find_by(id: params[:id])
        if expense
            expense.destroy
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = 5 LIMIT 1
DELETE FROM "expenses" WHERE "expenses"."id" = 5