bill_splitter/app/controllers/api/v1/groups_controller.rb

SELECT "groups".* FROM "groups"
---
    def index
        groups = Group.all

SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 LIMIT 1
---
    def show
        group = Group.find_by(id: params[:id])

INSERT INTO "groups" ("group_name", "created_by", "created_at", "updated_at", "member_ids") VALUES ('RM', '57988620-468d-437f-830d-64d69e916dbf', '2025-04-28 23:58:19.165317', '2025-04-28 23:58:19.165317', '{57988620-468d-437f-830d-64d69e916dbf,4e2e0338-bd9e-4812-a294-145412fdc7e9}') RETURNING "id"
INSERT INTO "group_members" ("group_id","user_id","created_at","updated_at") VALUES (NULL, '57988620-468d-437f-830d-64d69e916dbf', '2025-04-28 23:29:51.321070', '2025-04-28 23:29:51.321081'), (NULL, '4e2e0338-bd9e-4812-a294-145412fdc7e9', '2025-04-28 23:29:51.321084', '2025-04-28 23:29:51.321085') RETURNING "id"
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 4 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = '825cac45-9317-4911-86f9-b9415f800cfc' LIMIT 1
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 3 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 'e7f0d1dc-0c27-4f8d-9167-7d97618270c1' LIMIT 1
SELECT "groups".* FROM "groups" WHERE "groups"."id" IS NULL LIMIT 1
UPDATE "users" SET "updated_at" = '2025-04-29 00:38:51.771464', "group_ids" = '{1,2}' WHERE "users"."id" = 'e7f0d1dc-0c27-4f8d-9167-7d97618270c1'
---
    def create
        group = Group.new(group_params)
        group.member_ids = params[:member_ids] || []

        ActiveRecord::Base.transaction do
            if group.save
                group.reload
            # Update each user's group_ids
                group.member_ids.each do |user_id|
                    user = User.find(user_id)
                    user.group_ids << group.id
                    user.group_ids.uniq!  # just in case
                    user.save!

SELECT "groups".* FROM "groups" WHERE "groups"."id" = 5 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 'e7f0d1dc-0c27-4f8d-9167-7d97618270c1' LIMIT 1
DELETE FROM "groups" WHERE "groups"."id" = 3
UPDATE "users" SET "updated_at" = '2025-04-29 00:38:51.771464', "group_ids" = '{1,2}' WHERE "users"."id" = 'e7f0d1dc-0c27-4f8d-9167-7d97618270c1'
---
    def destroy
        group = Group.find_by(id: params[:id])

        if group
            ActiveRecord::Base.transaction do
            # Remove the group ID from all member users
                group.member_ids.each do |user_id|
                    user = User.find_by(id: user_id)
                    if user
                        user.group_ids.delete(group.id)
                        user.save!