bill_splitter/app/controllers/api/v1/users_controller.rb

    def show
        user = User.includes(:groups, :expenses).find_by(id: params[:id])

        if user
          render json: {
            id: user.id,
            name: user.name,
            email: user.email,
            groups: user.groups.as_json(only: [:id, :group_name]),
            expenses: user.expenses.as_json(
              only: [:id, :description, :total_amount, :group_id],
              include: { group: { only: [:id, :group_name] } }
            )
---
SELECT "users".* FROM "users" WHERE "users"."id" = '104c99eb-868e-4fc4-af95-9b0c324b5946' LIMIT 1

    def create
      user = User.new(user_params)

      if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "group_ids") VALUES ('David', 'david@example.com', '2025-04-29 00:44:19.303253', '2025-04-29 00:44:19.303253', '$2a$12$2btSu2DcM/P3qYqECS4Y8ORKcvKPjYS5r/zQJ3ucFuRcBJXRLqVfS', '{}') RETURNING "id"

    def destroy
        user = User.find_by(id: params[:id])

        if user
            ActiveRecord::Base.transaction do
            # Only touch groups the user is already part of
                Group.where(id: user.group_ids).find_each do |group|
                    group.member_ids.delete(user.id)
                    group.save!
---
SELECT "users".* FROM "users" WHERE "users"."id" = '104c99eb-868e-4fc4-af95-9b0c324b5946' LIMIT 1
SELECT "groups".* FROM "groups" WHERE "groups"."id" IN (1, 2) ORDER BY "groups"."id" ASC LIMIT 1000
DELETE FROM "users" WHERE "users"."id" = '104c99eb-868e-4fc4-af95-9b0c324b5946'
UPDATE "groups" SET "updated_at" = '2025-04-29 01:40:08.943274', "member_ids" = '{e7f0d1dc-0c27-4f8d-9167-7d97618270c1}' WHERE "groups"."id" = 1