app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 LIMIT 1
SELECT "expenses".* FROM "expenses" WHERE "expenses"."group_id" = 1
SELECT "users".* FROM "users" INNER JOIN "group_memberships" ON "users"."id" = "group_memberships"."user_id" WHERE "group_memberships"."group_id" = 16
---
    def show
      @group = Group.find(params[:id])
      @members = @group.members
      @expenses = @group.expenses.includes(:added_by_user)